devtodev/Kinetis-ARM/Ascensor/Sources/main.c
/* ###################################################################
**     Filename    : main.c
**     Project     : Gateway Wifi
**     Processor   : MKL46Z256VMC4
**     Version     : Driver 01.01
**     Compiler    : GNU C Compiler
**     Date/Time   : 2015-12-22, 15:49, # CodeGen: 0
**     Abstract    :
**         Main module.
**         This module contains user's application code.
**     Settings    :
**     Contents    :
**         No public methods
**
** ###################################################################*/
/*!
** @file main.c
** @version 01.01
** @brief
**         Main module.
**         This module contains user's application code.
*/         
/*!
**  @addtogroup main_module main module documentation
**  @{
*/         
/* MODULE main */


/* Including needed modules to compile this module/procedure */
#include "Cpu.h"
#include "Events.h"
#include "BT.h"
#include "ASerialLdd2.h"
#include "MMA1.h"
#include "GI2C1.h"
#include "I2C0.h"
#include "I2CSPY1.h"
#include "TMOUT1.h"
#include "LED1.h"
#include "LEDpin1.h"
#include "BitIoLdd3.h"
#include "LED2.h"
#include "LEDpin2.h"
#include "BitIoLdd4.h"
#include "Accel_Int1.h"
#include "BitIoLdd9.h"
#include "Accel_Int2.h"
#include "BitIoLdd10.h"
#include "WAIT1.h"
#include "CLS1.h"
#include "KSDK1.h"
#include "SegLCD1.h"
#include "TI1.h"
#include "ESP8266.h"
#include "ASerialLdd1.h"
#include "FRTOS1.h"
#include "TSK1.h"
#include "UTIL1.h"
#include "CS1.h"
#include "TU1.h"
#include "TimeDate.h"
#include "Flash.h"
#include "IntFlashLdd1.h"
#include "SW4.h"
#include "BitIoLdd1.h"
#include "SW1.h"
#include "BitIoLdd2.h"
#include "SW2.h"
#include "SW3.h"
#include "SW5.h"
#include "BitIoLdd7.h"
#include "SW6.h"
#include "BitIoLdd5.h"
#include "UTIL1.h"
#include "BitIoLdd8.h"
#include "BitIoLdd6.h"
#include "frtos_tasks.h"
/* Including shared modules, which are used for whole project */
#include "PE_Types.h"
#include "PE_Error.h"
#include "PE_Const.h"
#include "IO_Map.h"
/* User includes (#include below this line is not maintained by Processor Expert) */

/*lint -save  -e970 Disable MISRA rule (6.3) checking. */
int main(void)
/*lint -restore Enable MISRA rule (6.3) checking. */
{
  /* Write your local variable definition here */

  /*** Processor Expert internal initialization. DON'T REMOVE THIS CODE!!! ***/
  PE_low_level_init();
  /*** End of Processor Expert internal initialization.                    ***/


  /*** Don't write any code pass this line, or it will be deleted during code generation. ***/
  /*** RTOS startup code. Macro PEX_RTOS_START is defined by the RTOS component. DON'T MODIFY THIS CODE!!! ***/
  #ifdef PEX_RTOS_START
    PEX_RTOS_START();                  /* Startup of the selected RTOS. Macro is defined by the RTOS component. */
  #endif
  /*** End of RTOS startup code.  ***/
  /*** Processor Expert end of main routine. DON'T MODIFY THIS CODE!!! ***/
  for(;;){}
  /*** Processor Expert end of main routine. DON'T WRITE CODE BELOW!!! ***/
} /*** End of main routine. DO NOT MODIFY THIS TEXT!!! ***/

/* END main */
/*!
** @}
*/
/*
** ###################################################################
**
**     This file was created by Processor Expert 10.5 [05.21]
**     for the Freescale Kinetis series of microcontrollers.
**
** ###################################################################
*/
